
&НаСервереБезКонтекста
Процедура УправлениеНаСервере()
	
	// Вставить содержимое обработчика.
Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "", , );
Если Настройки <> Неопределено Тогда
  Настройки.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
  ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", Настройки);
КонецЕсли;

	
	
КонецПроцедуры

&НаКлиенте
Процедура Управление(Команда)
	УправлениеНаСервере();
	ОбновитьИнтерфейс();
    этаформа.Элементы.Декорация1.Видимость=Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеформы(Команда)
	// Вставить содержимое обработчика.
	УправлениеНаСервереСТ();
	ОбновитьИнтерфейс();
 этаформа.Элементы.Декорация1.Видимость=Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УправлениеНаСервереСТ()
		
Настройки = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", "", , );
Если Настройки <> Неопределено Тогда
  Настройки.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Авто;
  ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения", "", Настройки);
КонецЕсли;
		
КонецПроцедуры

