
&НаКлиенте
Процедура ВключитьКонтрольОстатковПриИзменении(Элемент)
	
	ВключитьКонтрольОстатковПриИзмененииНаСервере();
	
	Если Объект.КонтролироватьОстатки Тогда
		Элементы.ВидКонтроляОстатков.Доступность = Истина;
	Иначе
		Элементы.ВидКонтроляОстатков.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ВключитьКонтрольОстатковПриИзмененииНаСервере()
	Если Объект.КонтролироватьОстатки Тогда
		Объект.ВидКонтроляОстатков = Перечисления.ВидКонтроляОстатков.НаКонецМесяца;
	КонецЕсли;
КонецПроцедуры

