
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Справочники.Партии.ОбновитьПартию(Ссылка,Отказ); 
	
	// регистр ПартииТоваров Приход
	Движения.ПартииТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ПартииТоваров.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Склад 			= Склад;
		Движение.Организация 	= Организация;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Количество 	= ТекСтрокаТовары.Количество;
		Движение.Сумма 			= ТекСтрокаТовары.Сумма;
		Движение.СуммаНДС 		= 0;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если СуммаДокумента <> Товары.Итог("Сумма") Тогда    
		СуммаДокумента = Товары.Итог("Сумма");
	КонецЕсли;
	
	//Если ЭтоНовый() Тогда  
	//	УникИдент = Новый УникальныйИдентификатор();  
	//	сс = Документы.ПоступлениеТМЦ.ПолучитьСсылку(УникИдент);
	//	УстановитьСсылкуНового(сс);
	//Иначе
	//	сс = Ссылка;
	//КонецЕсли;	
		
	Справочники.Партии.УдалениеИлиОтменаУделенияПартийДокумента(Ссылка,ПометкаУдаления);		
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)	
	
	Для Каждого Стр из Товары Цикл 		
		Стр.Партия	= Неопределено;
		
		Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			Стр.Партия = Справочники.Партии.СоздатьНовуюПартию(Стр.Номенклатура).Ссылка;
		КонецЕсли;
		
	КонецЦикла;		
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияТМЦ") Тогда
		// Заполнение шапки
		Организация       = ДанныеЗаполнения.Организация;
		Ответственный     = ПараметрыСеанса.ТекущийПользователь;
		Склад             = ДанныеЗаполнения.Склад;
		ИнвентаризацияТМЦ = ДанныеЗаполнения.Ссылка;
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			
			Если ТекСтрокаТовары.Количество > ТекСтрокаТовары.КоличествоУчет Тогда
			
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура     = ТекСтрокаТовары.Номенклатура;
				НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
				НоваяСтрока.Количество       = ТекСтрокаТовары.Количество - ТекСтрокаТовары.КоличествоУчет;
				НоваяСтрока.Партия           = ТекСтрокаТовары.Партия;
				НоваяСтрока.Цена             = ТекСтрокаТовары.Цена;
				НоваяСтрока.Сумма            = НоваяСтрока.Количество * НоваяСтрока.Цена;
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

