
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГП = Последовательности.ОсновнаяПоследовательность.ПолучитьГраницу();
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоследовательность(Команда)
	ВосстановитьПоследовательностьНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьПоследовательностьНаСервере()
	Последовательности.ОсновнаяПоследовательность.Восстановить(ТекущаяДата());
	ГП = Последовательности.ОсновнаяПоследовательность.ПолучитьГраницу();
КонецПроцедуры
