
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Сообщить("Невозможно осздание партии! Создание Партии происходит только на основании документа поступления!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Попытка
		Если Не ЗначениеЗаполнено(Параметры.Отбор.ДатаОстатков) Тогда
			ДатаОстатков = КонецМесяца(ТекущаяДата());
		Иначе
			ДатаОстатков = Параметры.Отбор.ДатаОстатков;
		КонецЕсли;
		
		СтруктураОстатков   = Справочники.Партии.ПолучитьОстатокНаДату(Параметры.Отбор.Владелец,Параметры.Отбор.Организация,Параметры.Отбор.Склад,Параметры.Ключ,Параметры.Отбор.ДатаОстатков);
		ДатаОстатка 		= СтруктураОстатков.ДатаОстатка;

	Исключение         		
		ДатаОстатка 		= КонецМесяца(ТекущаяДата());
		СтруктураОстатков   = Справочники.Партии.ПолучитьОстатокНаДату(Параметры.Ключ.Владелец,Неопределено,Неопределено,Параметры.Ключ,ДатаОстатка);
	КонецПопытки; 	
	
	ОстатокНаКонецВсегоПериода = СтруктураОстатков.ОстатокНаКонецВсегоПериода;
	СуммаОстаткаВРубНаКонецВсегоПериода =  ОстатокНаКонецВсегоПериода * Объект.ЗакупочнаяЦена;
	ДатаОстаткаНаКонецвсегоПериода = КонецМесяца(ТекущаяДата());
	
	Остаток 			= СтруктураОстатков.Остаток;
	СуммаОстаткаВРуб 	= Остаток * Объект.ЗакупочнаяЦена;
	
	Если ЗначениеЗаполнено(Объект.ПриходныйДокумент) Тогда
		Поставщик 			= Объект.ПриходныйДокумент.Контрагент;
		ДоговорПоставщика 	= Объект.ПриходныйДокумент.ДоговорСКонтрагентом;
	КонецЕсли;
	
	Элементы.ДатаОстатка.Заголовок 						= "" +СтруктураОстатков.ВидКонтроляОстатков;
	Элементы.ДатаОстаткаНаКонецВсегоПериода.Заголовок 	= "на конец всего периода";
	ЭтаФорма.Заголовок = "" + Объект.Код+ " " +"Карточка партии: " +Объект.Владелец;
	
КонецПроцедуры