
&НаСервере
Процедура ЗаполнитьПоДокументуОснованияНаСервере()
	
	Объект.Организация  		= Объект.Основание.Организация;
	Объект.Склад				= Объект.Основание.Склад;
	Объект.Контрагент   		= Объект.Основание.Контрагент;
	Объект.ДоговорСКонтрагентом = Объект.Основание.ДоговорСКонтрагентом;
	
	Объект.Товары.Очистить();
	
	Для Каждого Стр из Объект.Основание.Товары Цикл
		
		НовСтр = Объект.Товары.Добавить();
		НовСтр.Номенклатура = Стр.Номенклатура;
		НовСтр.СуммаПродажи = Стр.Сумма;
		НовСтр.Количество 	= Стр.Количество;
		НовСтр.Цена 		= Стр.Цена;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументуОснования(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		Ответ = Вопрос("Заполнить по документу основания? Будет очищена табличная часть документа!", Режим, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			ОбновитьВидимостьЭлементов();
			Возврат;
		КонецЕсли;  	
		
		ЗаполнитьПоДокументуОснованияНаСервере();
		
	КонецЕсли;  
	
	ОбновитьВидимостьЭлементов();
		
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.СуммаПродажи = Элементы.Товары.ТекущиеДанные.Количество * Элементы.Товары.ТекущиеДанные.Цена;
	Объект.СуммаДокумента = Объект.Товары.Итог("СуммаПродажи");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Цена = Элементы.Товары.ТекущиеДанные.СуммаПродажи / Элементы.Товары.ТекущиеДанные.Количество;
	Объект.СуммаДокумента = Объект.Товары.Итог("СуммаПродажи");
КонецПроцедуры



&НаКлиенте
Функция СформироватьПараметрыФормы(ТекСтр)
	
	ЗначенияОтборов = Новый Структура;
	ЗначенияОтборов.Вставить("Владелец", ТекСтр.Номенклатура);
	ЗначенияОтборов.Вставить("Организация", Объект.Организация);
	ЗначенияОтборов.Вставить("Склад", Объект.Склад);	
	ЗначенияОтборов.Вставить("ДатаОстатков", Объект.Дата);
	
	ПараметрыФормы = Новый Структура("Ключ", ТекСтр.Партия);
	ПараметрыФормы.Вставить("Отбор", ЗначенияОтборов);

	Возврат ПараметрыФормы;
	
КонецФункции 
&НаКлиенте
Процедура ДвиженияПартииТоваровПартияОткрытие(Элемент, СтандартнаяОбработка)  	
	СтандартнаяОбработка = Ложь;	
	ПараметрыФормы = СформироватьПараметрыФормы(Элементы.ДвиженияПартииТоваров.ТекущиеДанные);
	ОткрытьФорму("Справочник.Партии.Форма.ФормаЭлементаОткрыть", ПараметрыФормы, Элемент);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементов()
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ЭтаФорма.Элементы.ТоварыСуммаСебестоимости.Видимость = Ложь;
		ЭтаФорма.Элементы.ТоварыСуммаСебестоимости.АвтоОтметкаНезаполненного = Ложь;
		ЭтаФорма.Элементы.ТоварыСуммаСебестоимости.ОтметкаНезаполненного = Ложь;
	Иначе
		ЭтаФорма.Элементы.ТоварыСуммаСебестоимости.Видимость = Истина;
		ЭтаФорма.Элементы.ТоварыСуммаСебестоимости.АвтоОтметкаНезаполненного = Истина;
		ЭтаФорма.Элементы.ТоварыСуммаСебестоимости.ОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры
