
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Отбор) Тогда
		
		Если Не ЗначениеЗаполнено(Параметры.Отбор.ДатаОстатков) Тогда
			ДатаОстатков = КонецМесяца(ТекущаяДата());
		Иначе
			ДатаОстатков = Параметры.Отбор.ДатаОстатков;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Параметры.Отбор.Организация) Тогда
			Сообщить("Не выбрана Организация!");
			Отказ = Истина;
			Возврат;
		ИначеЕсли Не ЗначениеЗаполнено(Параметры.Отбор.Склад) Тогда
			Сообщить("Не выбран Склад!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		СтруктураКонтроляОстатков = ОснПроцедурыИФ.ПолучитьСтруктуруКонтоляОстатков(Параметры.Отбор.Организация,ДатаОстатков);
		ДатаОстатков = СтруктураКонтроляОстатков.ДатаОстатков;
		
		Если СтруктураКонтроляОстатков.ВидКонтроляОстатков <> Неопределено Тогда
			КонтрольОстатковИнформация = "Контроль остатков включен! " +СтруктураКонтроляОстатков.ВидКонтроляОстатков+".";
			Элементы.КонтрольОстатковИнформация.ЦветТекста = WebЦвета.Зеленый;
		Иначе
			КонтрольОстатковИнформация = "Контроль остатков отключен у организации: " +Параметры.Отбор.Организация+ " !!!";
			Элементы.КонтрольОстатковИнформация.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	
		Список.Параметры.УстановитьЗначениеПараметра("Период",Параметры.Отбор.ДатаОстатков+1);
		Список.Параметры.УстановитьЗначениеПараметра("Номенклатура",Параметры.Отбор.Владелец);
		Список.Параметры.УстановитьЗначениеПараметра("Склад",Параметры.Отбор.Склад);
		Список.Параметры.УстановитьЗначениеПараметра("Организация",Параметры.Отбор.Организация);
		Организация = Параметры.Отбор.Организация;
		Склад		= Параметры.Отбор.Склад;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ф=0;
КонецПроцедуры



