
&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда
		
		ОбработкаОтвета = Новый ОписаниеОповещения("ОбработкаОтветаПользователя", ЭтотОбъект);
		ПоказатьВопрос(ОбработкаОтвета, "Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьПоОстаткамНаСервере();
		
	КонецЕсли;
	
	ОбновитьПодвал();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	
	Объект.Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровОстатки.Номенклатура,
		|	ПартииТоваровОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПартииТоваровОстатки.КоличествоОстаток КАК КоличествоУчет,
		|	- ПартииТоваровОстатки.КоличествоОстаток КАК Отклонение,
		|	ПартииТоваровОстатки.Партия.ЗакупочнаяЦена КАК Цена,
		|	ПартииТоваровОстатки.СуммаОстаток КАК СуммаУчет,
		|	ПартииТоваровОстатки.Партия
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Склад = &Склад) КАК ПартииТоваровОстатки";
	
	Запрос.УстановитьПараметр("Дата",        Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Склад",       Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаИнвентаризации = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаИнвентаризации, Выборка);
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаПользователя(ОтветПользователя, ДополнительныеПараметры) Экспорт
	
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоОстаткамНаСервере();
	КонецЕсли;
	
	ОбновитьПодвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьУчетныеКоличества(Команда)

	; // Задел на будущее
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	
	ЗначенияОтборов = Новый Структура;
	ЗначенияОтборов.Вставить("Владелец", ТекСтр.Номенклатура);
	ЗначенияОтборов.Вставить("Организация", Объект.Организация);
	ЗначенияОтборов.Вставить("Склад", Объект.Склад);  	
	ЗначенияОтборов.Вставить("ДатаОстатков", Объект.Дата);

	ПараметрыФормы = Новый Структура("Отбор", ЗначенияОтборов);
	
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ВыборПартииЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Партии.Форма.ФормаВыбора", ПараметрыФормы, Элемент,,,, ОбработкаОповещения);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	;

КонецПроцедуры

&НаКлиенте 
Процедура  ВыборПартииЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	
	Если ВыбранноеЗначение <> неопределено Тогда
		ТекСтр.Партия = ВыбранноеЗначение;
		
		
		Цена = 0;
		Количество = 0;
		
		ЗаполнитьЦенуУчетноеКоличество(ВыбранноеЗначение, Цена, Количество);
		
		ТекСтр.Цена = Цена;
		текСтр.КоличествоУчет = Количество;
		текСтр.СуммаУчет = ТекСтр.Цена * ТекСтр.КоличествоУчет;
		текСтр.Отклонение = текСтр.Количество - текСтр.КоличествоУчет;
		
	КонецЕсли;
	
	ОбновитьПодвал();
	
КонецПроцедуры

Процедура ЗаполнитьЦенуУчетноеКоличество(Партия, Цена, Количество)
	
	Цена = Партия.ЗакупочнаяЦена;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровОстатки.КоличествоОстаток,
		|	ПартииТоваровОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И Партия = &Партия
		|				И Склад = &Склад
		|				И Номенклатура = &Номенклатура) КАК ПартииТоваровОстатки";
	
	Запрос.УстановитьПараметр("Дата",         Объект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", Партия.Владелец);
	Запрос.УстановитьПараметр("Организация",  Объект.Организация);
	Запрос.УстановитьПараметр("Партия",       Партия);
	Запрос.УстановитьПараметр("Склад",        Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Количество = Выборка.КоличествоОстаток;
		
	КонецЕсли;
	    	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвал()
	
	ИтогоУчет = Объект.Товары.Итог("СуммаУчет");
	Итого     = объект.Товары.Итог("Сумма");
	
	Отклонение = Итого - ИтогоУчет;
		
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекСтр = Элементы.Товары.ТекущиеДанные;
	
	текСтр.Отклонение = текСтр.Количество - текСтр.КоличествоУчет;
	ТекСтр.Сумма = ТекСтр.Количество * ТекСтр.Цена;
	
	ОбновитьПодвал();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПодвал();

КонецПроцедуры

