
Процедура Печать_Накладной(ТабДок, Ссылка) Экспорт

	Макет = Документы.ОприходованиеТМЦ.ПолучитьМакет("Накладная");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеТМЦ.Дата,
	|	СписаниеТМЦ.Комментарий,
	|	СписаниеТМЦ.Номер,
	|	СписаниеТМЦ.Организация,
	|	СписаниеТМЦ.Склад,
	|	СписаниеТМЦ.СуммаДокумента КАК Всего,
	|	СписаниеТМЦ.ИнвентаризацияТМЦ,
	|	СписаниеТМЦ.Товары.(
	|		НомерСтроки,
	|		Номенклатура КАК Товар,
	|		Количество,
	|		Партия,
	|		ЕдиницаИзмерения,
	|		Партия.ЗакупочнаяЦена КАК Цена,
	|		СписаниеТМЦ.Товары.Партия.ЗакупочнаяЦена * СписаниеТМЦ.Товары.Количество КАК Сумма
	|	)
	|ИЗ
	|	Документ.СписаниеТМЦ КАК СписаниеТМЦ
	|ГДЕ
	|	СписаниеТМЦ.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьШапка       = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока      = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал      = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();
		
	Пока Выборка.Следующий() Цикл

		ОбластьШапка.Параметры.Заполнить(Выборка);
		ОбластьШапка.Параметры.ТекстЗаголовка = Ссылка; 
		ТабДок.Вывести(ОбластьШапка);

		ВыборкаТовары = Выборка.Товары.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьСтрока);
			
		КонецЦикла;

		ОбластьПодвал.Параметры.Заполнить(Выборка);
		
		ОбластьПодвал.Параметры.ИтоговаяСтрока = "Всего наименований " + ВыборкаТовары.Количество()
	                                           + ", на сумму " + Выборка.Всего + " руб.";
											   
		ОбластьПодвал.Параметры.СуммаПрописью =  ЧислоПрописью(Выборка.Всего, "L=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");

		ТабДок.Вывести(ОбластьПодвал);

	КонецЦикла;

КонецПроцедуры
