
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	НаименованиеПользователяИБ =  Строка(ПользователиИнформационнойБазы.ТекущийПользователь());
	
	Пользователь = Справочники.Пользователи.НайтиПоКоду(НаименованиеПользователяИБ);
	
	Если не ЗначениеЗаполнено(Пользователь) Тогда
		ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательОбъект.Наименование = НаименованиеПользователяИБ;
		ПользовательОбъект.Код = НаименованиеПользователяИБ;
		ПользовательОбъект.Записать();
		Пользователь = ПользовательОбъект.Ссылка;
	КонецЕсли;   	
	
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
	
КонецПроцедуры
